---
kind: method
id: M:Autodesk.Revit.DB.Structure.PathReinforcement.IsValidPrimaryBarOrientation(Autodesk.Revit.DB.Structure.ReinforcementBarOrientation)
source: html/96ef910c-7689-9aaa-3637-50826bce3f54.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcement.IsValidPrimaryBarOrientation Method

Checks if orientation for primary bars is valid.

## Syntax (C#)
```csharp
public bool IsValidPrimaryBarOrientation(
	ReinforcementBarOrientation orientation
)
```

## Parameters
- **orientation** (`Autodesk.Revit.DB.Structure.ReinforcementBarOrientation`) - An orientation.

## Returns
True if orientation for primary bars are valid.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration